In [1]:
import sqlite3
from sqlite3 import Error
import pandas as pd

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

# Replace with the path to the northwind.db file on your computer (e.g. "C:/Users/...")
db_path = 'northwind.db'

con = create_connection(db_path)
cur = con.cursor()

Connection to SQLite DB successful

In [2]:
# Convenience function for queries. Note that "return_pandas" can only be set to True for SQL statements
# that return data (e.g. it has to be False for statements like DROP TABLE and CREATE TABLE)
def execute_query(query_string, return_pandas=True):
    if return_pandas:
        response = pd.read_sql_query(query_string, con)
    else:
        cur.execute(query_string)
        response = cur.fetchall()
    if response is None:
        con.commit()
    else:
        return response

In [35]:
execute_query("""select count(*) from orders;""")

   count(*)
0       830

In [36]:
execute_query("""select min(orderdate) from orders;""")

  min(orderdate)
0     1996-07-04

In [37]:
execute_query("""select max(orderdate) from orders;""")

  max(orderdate)
0     1998-05-06

In [38]:
execute_query("""DROP TABLE if exists end_obs_dates;""", return_pandas=False)
execute_query("""CREATE TABLE end_obs_dates 
AS

-- Recursive query example (something like FOR loop for SQL)
WITH RECURSIVE
  cnt(x) AS (
     SELECT 0
     UNION ALL
     SELECT x+1 FROM cnt
      LIMIT (SELECT ROUND(((julianday('1998-06-01') - julianday('1996-08-01'))/30) + 1)) -- this counts number of months between these two days
  )
SELECT date('1996-08-01', '+' || x || ' month') as end_obs_date FROM cnt;""", return_pandas=False)

[]

In [39]:
execute_query("""select * from end_obs_dates""")

   end_obs_date
0    1996-08-01
1    1996-09-01
2    1996-10-01
3    1996-11-01
4    1996-12-01
5    1997-01-01
6    1997-02-01
7    1997-03-01
8    1997-04-01
9    1997-05-01
10   1997-06-01
11   1997-07-01
12   1997-08-01
13   1997-09-01
14   1997-10-01
15   1997-11-01
16   1997-12-01
17   1998-01-01
18   1998-02-01
19   1998-03-01
20   1998-04-01
21   1998-05-01
22   1998-06-01